Revit 2027 API
FabricationConfigurationInfo.UnitSystem Property
 The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UnitSystem UnitSystem { get; }
Public ReadOnly Property UnitSystem As UnitSystem
	Get
public:
property UnitSystem UnitSystem {
	UnitSystem get ();
}
member UnitSystem : UnitSystem with get
Property Value
UnitSystem
See Also
Reference
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace